package Info;

import java.util.Scanner;

public class infDroid {

    static Scanner console = new Scanner(System.in);

    infDroid() {
        while (true) {
            System.out.print("""
                    
                    Інформація про спорядження:
                    1 - Класичний дроїд
                    2 - Танк-дроїд
                    3 - Дроїд-розвідник
                    4 - Дроїд-снайпер
                    5 - Дроїд-медик
                    0 - Повернутись назад
                    -> """);
            int f = console.nextInt();
            if (f == 0) {
                return;
            } else if (f == 1) {
                System.out.print("""
                        
                        Класичний дроїд:
                        Здоров'я - 200, Броня - 100
                        Урон - 50, Пробиття - 100, Дальність - 8
                        Максимум енергії - 0, Дальність ходу - 12
                        К-сть обладнання - 2, Спецможливість - відсутня
                        """);
            } else if (f == 2) {
                System.out.print("""
                        
                        Танк-дроїд:
                        Здоров'я - 200, Броня - 200
                        Урон - 50, Пробиття - 100, Дальність - 6
                        Максимум енергії - 100, Дальність ходу - 8
                        К-сть обладнання - 3, Спецможливість - Щит
                        За 100 од. накопленої енергії активує спецможливість щит
                        Броня на 3 ходи подвоюється
                        """);
            } else if (f == 3) {
                System.out.print("""
                        
                        Дроїд-розвідник:
                        Здоров'я - 200, Броня - 100
                        Урон - 100, Пробиття - 100, Дальність - 3
                        Максимум енергії - 100, Дальність ходу - 18
                        К-сть обладнання - 1, Спецможливість - Невидимість
                        За 100 од. накопленої енергії активує спецможливість невидимість
                        Дроїд на 3 ходи стає невидимим
                        """);
            } else if (f == 4) {
                System.out.print("""
                        
                        Дроїд-снайпер:
                        Здоров'я - 200, Броня - 100
                        Урон - 50, Пробиття - 200, Дальність - 20
                        Максимум енергії - 100, Дальність ходу - 6
                        К-сть обладнання - 2, Спецможливість - Ультра-урон
                        За 100 од. накопленої енергії активує спецможливість ультра-урон
                        На один вистріл урон потроюється
                        Особливість - активний 1 раз на 2 ходи
                        """);
            } else if (f == 5) {
                System.out.print("""
                        
                        Дроїд-медик:
                        Здоров'я - 200, Броня - 100
                        Урон - -50, Пробиття - 0, Дальність - 8
                        Максимум енергії - 100, Дальність ходу - 12
                        К-сть обладнання - 2, Спецможливість - Сфера відновлення
                        За 100 од. накопленої енергії активує спецможливість сфера відновлення
                        Сфера повністю відновлює здоров'я всім дроїдам в межах 4 клітинок
                        """);
            } else {
                System.out.print("Помилка введення!\n\n");
            }
        }
    }
}